Revit 2026 API

# FabricLocation Enumeration

---

Fabric location in the host

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricLocation
```
```vb
Public Enumeration FabricLocation
```
```cpp
public enum class FabricLocation
```
```fsharp
type FabricLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| BottomOrInternal | 1 | The fabric is on the bottom face of a floor host, or on the internal face of a wall host. |
| TopOrExternal | 0 | The fabric is on the top face of a floor host, or on the external face of a wall host. |

#### Reference

Autodesk.Revit.DB.Structure Namespace